package 对象;
/* 一、面向对象概述
 * 1、什么是对象
 * 对象是一个抽象概念，英文叫Object，表示任意存在的事物。
 * 对象是事物存在的实体，如人类、计算机、书桌等。通常对象都会被分为两个部分，即动态部分与静态部分。
 * （1）静态部分：顾名思义就是不能动的部分，这个部分被称为“属性”，任何对象都会具备自身属性，并且他们是客观存在不能忽视的
 * 静态部分如：年龄、胖瘦、高矮、性别等
 * （2）、动态部分：然而具有这些属性的人会执行那些动作也是一个值得探讨的部分，这些是这个人具有的行为，
 * 人类通过探讨对象的属性和观察对象的行为了解对象
 * 动态部分如：哭泣、行走、说话、微笑等
 * 在计算机的世界中，面向对象程序设计的思想要以对象来思考问题，首先要将现实世界的实体抽象为对象，然后考虑这个对象具备的属性和行为。
 * 列如：一只大雁要从北方非往南方
 * ①首先可以从这一问题中抽象出对象，这里抽象出的对象为大雁
 * ②然后识别这个对象的属性。对象具备的属性都是静态属性，如大雁有一堆翅膀、黑色羽毛等
 * ③接着识别这个对象的动态行为，即这只大雁可以进行的动作，如飞行、觅食等，这些行为都是因为这个对象基于其属性而具有的动作
 * ④识别出这些对象的属性和行为后，这个对象就被定义完成，然后可以根据这只大雁具有的特征制定这只大雁要从北方飞向南方的具体方案以解决问题
 * 2、什么是类
 * 类就是同一类事物的统称，如果将现实世界中的一个事物抽象成对象，类就是这类对象的统称，如鸟类、家禽类、人类等
 * 类是构造对象时所依赖的规范，如一只鸟具有一对翅膀，它可以通过这对翅膀飞行，而基本上大部分鸟都具有翅膀这个特性和飞行的技能，
 * 这样的具有相同特性和行为的一类事物就称为类。注：类就是对象的设计图
 * 3、面向对象编程设计的特征
 * 共三大特征：封装、继承、多态
 * ①封装
 * 封装就是面向对象编程的核心思想，将对象的属性和行为封装起来，而将对象的属性和行为进行封装起来的载体就是类，
 * 类通常对客户隐藏其实现实细节，就是封装的思想
 * ②继承
 * 当处理一个问腿时，可以将一些有用的类保留下来，这些类通常有相同的属性，甚至相同的方法，
 * 当遇到相同的问题时可以拿来复用，并用保留鸟类具有的属性和行为，继承性主要利用特定对象之间的共有属性
 * ③多条
 * 了解了父类和子类，其实将父类对象应用于子类的特性就是多态
 */
public class 面向对象概述笔记 {
}
