package 练习题;

public class 在特定范围内排除某个字符 {
    public static void main(String[] args) {
        //题目：从1到500所有自然数中不含数字4的自然数共有多少个
        //声明一个变量存储不包含4的个数
        int a = 0;
        for (int i = 1; i <= 500; i++) {
            /*
            i%10==4 判断个位上是否有4，i/100==4 判断百位上是否是4。
            i/10%10==4 判断十位上是否是4.
            判断十位上是否是4还可以：i%100/10
             */
            if ((i == 4) || (i % 10 == 4) || (i / 100 == 4) || (i / 10 % 10 == 4)) {
                continue;//continue可以执行下一个循环，也可以在外层for编写标签进行外层下一个循环
            }
            a++;
        }
        System.out.println("不包含4个数：" + a);
    }
}